Autodesk.Revit.DB.IFC.IFCOpeningData.GetOpeningSolids
Gets opening solids.
Returns:
The solids.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningData.GetExtrusionData
Gets extrusion data.
Returns:
The extrusion data.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningData.IsRecess
Trus if it is a recess, false if it is an opening.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningData.OpeningElementId
The opening element id.
Since:
2014

Autodesk.Revit.DB.IFC.IFCOpeningData
A class that contains opening data including extrusion data, opening solids and opening element id.
Since:
2014